"use strict";
/*
Запись Use strict всегда должна 
находитьсе перед исполняеиым кодом.
Перед записью Use strict допускаются
только комментарии (не исполняемый код)
*/

//Точка с запятой

//console.log('Учим JS'); 
//['Учим', 'JS'].forEach(alert);

/*
function name () {
    console.log ('Учим');
    console.log ('JS');
}
name();
*/

//Комментарий

/* 
Многострочный 
комментарий
*/

/*
ЧУВСТВИТЕЛЬНОСТЬ К РЕГИТСТРУ
JavaScript является регистрозависимым языком.
Это значит, что ключевые слова, переменные, имена функций 
и другие идентефикаторв должны содержать одинаковые наборы прописных и строчных букв.
*/

/*
ПРОБЕЛЫ
JavaScript игнорирует несколько пробелов подряд
Пробелы принято размещать вокруг операторов: =, +, -, * и /.
*/

/*
let str = 'Текст';
let str='Текст';
*/

/*
ДЛИНА СТРОКИ
Для лучшей читаемости кода рекомендуется избегать строк 
длиной более 80 символов. Если JavaScript инструкция имеет
большкю длину, то её желательно разорвать.
Разрыв инструкции рекомендуется делать после оператора.
*/

//Пример
/*
document.getElementById('text').innerHTML =
'Текст для данного поля';
*/

/*
КАВЫЧКИ
В JavaScript моут использоваться одинарные, 
двойные либо обратные кавычки.
Важно помнить, что открытая кавычка
без закрытой вызовет ошибку и наоборот.
*/

//Пример
/*
console.log('Учим JS'); // Одинарные
console.log("Учим JS"); // Двойные
console.log(`Учим JS`); // Обратные
*/

//Домашняя работа

console.log("Я учу JS");

console.log("Учим);
console.log("JS");
//Здесь ошибка ^

   