// ДОМАШНЕЕ ЗАДАНИЕ

/*
1) Придумай имя переменной для хранения цвета
глаз пользователя сайта.
2) Объяви две переменные - user и userName.
Присвой значение "Вася" переменной userName.
Скопируй значение переменной userName в
переменную user.
Выведи в консоль переменную user. Результат должен
быть "Вася".
3) Напиши в комиентариях какой вариант
либо варианты записаны НЕ верно?
*/

//Вариант №1
/*
let user = 'Вася'; 
let age = 36;
*/

//Вариант №2
//let myAge = 36;

//Вариант №3
//const BLOCK_SIZE = 14 + 50;

//Вариант №4
//const BLOCK_HEIGHT = 100;

//Вариант №5
/*
if(true) {
    var size = 15;
}
console.log(size);
*/

//ВЫПОЛНЕНИЕ ДОМАШНЕЙ РАБОТЫ
/*
1) let userColorEyes;
2) let user;
   let userName = 'Вася';
   user = userName;
   console.log(user);
3) Вариант №1. Потому, что после значения первой
переменной отсутствует ; Либо нужно начать
объявление второй переменной с новой строки.
В этом случае объявления будут работать, 
но рекомендуется после каждого поставить ;

let user = 'Вася'; 
let age = 36;
*/


/*
2)
let user;
let userName = 'Вася';
user = userName;
console.log(user);
*/

/*
3)
let user = 'Вася';
let age = 36;
console.log(user)
*/
/*
if(true) {
    var size = 28;
}
console.log(size);
*/